CSI API ETABS v1

# cLoadCasesHyperStatic Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseHyperStatic HyperStatic { get; }

    ReadOnly Property HyperStatic As cCaseHyperStatic
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseHyperStatic

    value = instance.HyperStatic

    property cCaseHyperStatic^ HyperStatic {
    	cCaseHyperStatic^ get ();
    }

    abstract HyperStatic : cCaseHyperStatic with get

#### Property Value

Type: cCaseHyperStatic

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com